RhinoInside.Revit API Documentation
GeometryEncoder.ToLine Method
 Converts the specified Rhino.Geometry.Line to an equivalent Autodesk.Revit.DB.Line.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Line ToLine(
	this Rhino.Geometry.Line line
)
@staticmethod
def ToLine(
	line: Rhino.Geometry.Line
) -> Autodesk.Revit.DB.Line
Parameters
line
Type: Rhino.Geometry.Line
Rhino line to convert.
Return Value
Type: Autodesk.Revit.DB.Line
Revit line that is equivalent to the provided Rhino line.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Line. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToLine(Line) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Line revitLine = rhinoLine.ToLine();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_line = rhino_line.ToLine()    # type: DB.Line
 Using ToLine(Line) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Line revitLine = GeometryEncoder.ToLine(rhinoLine);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_line = GE.ToLine(rhino_line)    # type: DB.Line
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace